package ru.sber.transport.request.external.model;

/**
 * Данные страницы.
 */
public interface PageData {

    /**
     * Возвращает номер страницы.
     *
     * @return номер страницы
     */
    int number();

    /**
     * Возвращает количество элементов на странице.
     *
     * @return количество элементов на странице
     */
    int size();

    /**
     * Возвращает признак последней страницы.
     *
     * @return признак последней страницы
     */
    boolean last();

    /**
     * Возвращает признак первой страницы.
     *
     * @return признак первой страницы
     */
    boolean first();

    /**
     * Возвращает общее количество элементов.
     *
     * @return общее количество элементов
     */
    int total();

    /**
     * Возвращает общее количество страниц.
     *
     * @return общее количество страниц
     */
    int count();

}
