package ru.sberbank.ditsib.transport.request.database.model.carsharing;

import jakarta.persistence.*;
import lombok.*;

import java.time.temporal.ChronoUnit;
import java.util.UUID;

/**
 * Список текстовых полей заявки на подключение к корп.каршерингу. В первом поле содержит число и ChronoUnit
 * загружаемые из настроек КС
 */
@Entity
@Table(schema = "request", name = "carsharing_join_request_text")
@Getter
@Setter
@Builder
@AllArgsConstructor
@NoArgsConstructor
public class CarsharingJoinRequestText {
    
    /** Корп.клиент, для которого актуальны настройки текстовых полей */
    @Id
    @Column(name = "organization_id")
    private UUID organizationId;
    
    /** Первая часть текстового поля до ФИО (до указания КС) */
    @Builder.Default
    @Column(name = "before_fio_first_part")
    private String beforeFioFirstPart = "Вы сможете воспользоваться услугой корпоративного каршеринга только после " +
                                        "выполнения данного обращения. Нам потребуется ";
    
    //todo слушатель настроек КС, конвертер из deadlineValue + deadlineUnit -> текст, маппер, ДТО, апи для настройки текстовых полей
    /** Вторая часть текстового поля до ФИО. Выводится в текст из deadlineValue и deadlineUnit программно */
    @Builder.Default
    @Column(name = "before_fio_second_part")
    private String beforeFioSecondPart = "несколько дней";
    
    /** Значение времени из настройки КС */
    @Column(name = "deadline_value", precision = 3, columnDefinition = "int2 (Types#SMALLINT)")
    private Integer deadlineValue;
    
    /** Единица измерения времени из настройки КС */
    @Enumerated(EnumType.STRING)
    @Column(name = "deadline_unit")
    private ChronoUnit deadlineUnit;
    
    /** Третья часть текстового поля до ФИО (после указания КС) */
    @Builder.Default
    @Column(name = "before_fio_third_part")
    private String beforeFioThirdPart = " для направления данной заявки на обработку каршеринговой компанией.";
    
    /** Текст после номера телефона */
    @Builder.Default
    @Column(name = "after_phone")
    private String afterPhone = "Укажите мобильный телефон, который Вы использовали для регистрации в мобильном " +
                                "приложении Оператора Каршеринга";
    
    /** Текст после почты */
    @Builder.Default
    @Column(name = "after_email")
    private String afterEmail = "Укажите e-mail который Вы использовали для регистрации в мобильном приложении " +
                                "Оператора Каршеринга";
    
    /** Текст после списка корп.каршерингов */
    @Builder.Default
    @Column(name = "after_carsharings")
    private String afterCarsharings = "После регистрации в мобильном приложении заполните поля ниже и оформите " +
                                      "прикрепление к корпоративному договору.\n" +
                                      "*Если Вы уже зарегистрированы в Каршеринге - операторе банка, то необходимо " +
                                      "создать данное обращение для прикрепления к корпоративному договору и у Вас в " +
                                      "приложении появится Корпоративный профиль для производственных поездок.";
    
    /** Текст чекбокса "Согласие с Памяткой П-144" */
    @Builder.Default
    @Column(name = "with_rules_p144_agree")
    private String withRulesP144Agree = "Я подтверждаю, что ознакомлен(а) со всеми правилами использования сервиса в " +
                                        "Банке (Памятка П-144 ), в том числе, что в случае незаведения обращения " +
                                        "\"Поездка на Каршеринге\" в Сбердруг на конкретную поездку и несогласования " +
                                        "его со своим рукововодителем, поездка не сможет быть учетна в " +
                                        "производственных расходах и Банк направит требование Оператору Каршерига " +
                                        "о переводе расходов по данной поездке на мой личный счет.\n" +
                                        "Я осуществил(а) регистрацию в мобильном приложении Оператора Каршеринга, " +
                                        "ознакомлена(а) с договором/пользовательским соглашением Каршеринговой " +
                                        "компании и в случае нарушения мною условий договора/соглашения (штрафы и " +
                                        "др.) и причинения ущерба имуществу Оператора каршеринга, " +
                                        "несу ответственность самостоятельно*";
    
    /** Текст чекбокса "Согласие на обработку персональных данных" */
    @Builder.Default
    @Column(name = "with_personal_data_agree")
    private String withPersonalDataAgree = "Даю согласие ПАО Сбербанк (117997, г. Москва, ул. Вавилова, д. 19) на " +
                                           "автоматизированную обработку (с совершением действий: сбор, хранение, " +
                                           "передачу, обезличивание, удаление и уничтожение) моих персональных данных" +
                                           " (ФИО, телефонный номер, адрес электронной почты) в целях прикрепления " +
                                           "к договору корпоративного Каршеринга (в формате занесения в электронный " +
                                           "кабинет корпоративного пользователя).\n" +
                                           "Я осведомлен(а), что могу отозвать настоящее согласие в любое время " +
                                           "посредством соответствующего заявления в письменной форме, " +
                                           "адресованного ПАО Сбербанк.";
}
