package ru.sber.transport.dispatcher.database.model;

import lombok.Getter;
import lombok.RequiredArgsConstructor;

/**
 * Список причин конфликта при обработке смены из МАИС
 */
@Getter
@RequiredArgsConstructor
public enum ConflictReason {
    /**
     * Автомобиль не находится в эксплуатации
     */
    VEHICLE_NOT_IN_EXPLOITATION("Автомобиль %s не находится в эксплуатации"),

    /**
     * Водитель не является активным
     */
    DRIVER_INACTIVE("Водитель %s не является активным"),

    /**
     * Автомобиль и водитель относятся к разным филиалам
     */
    DIFFERENT_AUTOPARKS("Автомобиль %s и водитель %s относятся к разным филиалам"),

    /**
     * Автомобиль и водитель относятся к разным контрагентам
     */
    DIFFERENT_CONTRACTORS("Автомобиль %s и водитель %s относятся к разным контрагентам"),

    /**
     * На автомобиль и водителя уже существует активная смена
     */
    BOTH_EXISTING_ACTIVE_SHIFT("На автомобиль %s и водителя %s уже существует активная смена"),

    /**
     * На водителя уже существует активная смена
     */
    DRIVER_EXISTING_ACTIVE_SHIFT("На водителя %s уже существует активная смена"),

    /**
     * На автомобиль уже существует активная смена
     */
    VEHICLE_EXISTING_ACTIVE_SHIFT("На автомобиль %s уже существует активная смена"),

    /**
     * Водитель не найден
     */
    DRIVER_NOT_FOUND("Водитель %s не найден"),

    /**
     * Автомобиль не найден
     */
    VEHICLE_NOT_FOUND("Автомобиль %s не найден"),

    /**
     * Водитель не принадлежит контрагенту пользователя
     */
    DRIVER_NOT_BELONGS_TO_USERS_CONTRACTOR("Водитель не принадлежит контрагенту пользователя"),

    /**
     * Автомобиль не принадлежит контрагенту пользователя
     */
    VEHICLE_NOT_BELONGS_TO_USERS_CONTRACTOR("Автомобиль не принадлежит контрагенту пользователя"),

    /**
     * Пользователь должен принадлежать филиалу контрагента
     */
    USER_NOT_BELONGS_TO_CONTRACTORS_AUTOPARK("Пользователь не принадлежит филиалу контрагента"),

    /**
     * Водитель не принадлежит филиалу пользователя
     */
    DRIVER_NOT_BELONGS_TO_USERS_AUTOPARK("Водитель не принадлежит филиалу пользователя"),

    /**
     * Автомобиль не принадлежит филиалу пользователя
     */
    VEHICLE_NOT_BELONGS_TO_USERS_AUTOPARK("Автомобиль не принадлежит филиалу пользователя");

    private final String descriptionForException;

}
