import React from 'react';
import { ServiceType } from 'modules/DashboardCards/constants/general.constants';
import type { TCollapseItemsByService } from 'modules/DashboardCards/types/faq.types';

export const itemsByService: TCollapseItemsByService = {
  [ServiceType.ALL]: [
    {
      label: 'Где найти приложение СберТранспорт?',
      children: (
        <p>
          Приложение СберТранспорт вы можете скачать на свое мобильное устройство в Apps.
          <br />
          На рабочем компьютере воспользоваться услугами СберТранспорта взможно по ссылке:
          {' '}
          <a href="https://sbertransport.sigma.sbrf.ru/client/home" target="_blank">
            <u>https://sbertransport.sigma.sbrf.ru/client/home</u>
          </a>
          <br />
          Теперь ярлык СберТранспорта также размещен на главной странице СберБраузера во вкладке полезные ссылки.
        </p>
      ),
    },
    {
      label: 'Куда обращаться за помощью?',
      children: (
        <p>
          Если вы пользуйтесь сервисами СберТранспорта в служебных целях, то с вами всегда на связи Единая служба поддержки транспортных услуг Сбера.
          <br />
          <br />
          <b>Здесь вам помогут:</b>
          <ul>
            <li>узнать статус заявки на такси, перевозку груза или лимиты трат подразделения</li>
            <li>оформить компенсацию расходов за использование личного и общественного транспорта</li>
            <li>получить консультацию по курьерской доставке или каршерингу</li>
            <li>заполнить шаблоны транспортных услуг в СберТранспорт</li>
            <li>настроить руководителям делегирование, найти контакты согласующего и решить многие другие вопросы</li>
          </ul>
          <br />
          <b>а также:</b>
          <ul>
            <li>принять обратную связь о качестве предоставляемых услуг</li>
            <li>решить в моменте срочный вопрос</li>
          </ul>
          <br />
          <b>Единая служба поддержки работает во всех регионах присутствия банка в режиме 24/7:</b>
          <ul>
            <li>звоните на федеральный номер 8 (800) 707-48-82</li>
            <li>
              напишите на
              {' '}
              <a href="mailto:catransport@sberbank.ru">
                <u>внешнюю</u>
              </a>
              {' '}
              или
              {' '}
              <a href="mailto:transport@omega.sbrf.ru">
                <u>внутреннюю почту</u>
              </a>
            </li>
            <li>
              отправьте сообщение в
              {' '}
              <a href="https://sberchat.sberbank.ru/@SBERTRANSPORT" target="_blank">СберЧат</a>
            </li>
          </ul>
        </p>
      ),
    },
    {
      label: 'Как распределяются Лимиты, что делать, если лимит закончился?',
      children: (
        <p>
          Лимит подразделения виден руководителю, который контролирует использование лимита.
          <br />
          <br />
          Лимит рассчитывается на основании ретро-данных и, в случае нехватки, всегда есть возможность добавить лимит, обратившись к куратору по вашей территории
          <br />
          <br />
          Для улучшения прозрачности и удобства использования лимитов мы провели ряд улучшений:
          <br />
          Доработана индикация остатков: теперь при оформлении заказа вы сразу увидите доступный остаток лимита.
          <br />
          Появилась новая функция: в боковом меню раздела «Финансы» отображается ответственный сотрудник за лимиты вашего подразделения.
          <br />
          Автоматические уведомления: система автоматически уведомляет ответственных лиц, когда остаток лимитов достигает критического уровня (менее 30%). Это позволяет своевременно реагировать и предотвращать ситуации нехватки ресурсов.
          <br />
          Дополнительная информация: Если вы не видите своего ответственного сотрудника в интерфейсе, мы собрали для вас контакты ответственных по вашим подразделениям.
          <br />
          <br />
          Эти меры направлены на повышение комфорта и эффективности вашей работы. Мы уверены, что вместе сможем успешно преодолеть любые трудности и сделать нашу работу ещё более продуктивной и комфортной.
          Спасибо за понимание и поддержку!
          <br />
          <br />
          Также, чтобы оптимизировать использование ресурсов и обеспечить равномерное распределение лимитов среди всех подразделений, мы предлагаем рассмотреть использование модуля «совместные поездки». Такой подход позволит значительно увеличить общий объем доступных лимитов, обеспечив стабильность и постоянное наличие лимита на поездки.
        </p>
      ),
    },
    {
      label: 'Почему обновление приложения происходит так часто (1 раз в неделю)?',
      children: (
        <p>
          СберТранспорт постоянно развивается с учетом интересов наших пользователей, приложение обновляется не чаще 1 раза в месяц
          Можете пропустить обновление, если система не требует обновляться.
        </p>
      ),
    },
  ],
  [ServiceType.PASSENGERS]: [
    {
      label: 'Возможно ли установить точку и указать в комментарии водителю, куда именно нужно подъехать?',
      children: (
        <p>Да, произведена доработка и теперь точку возможно поставить как в мобильном приложении, так и в веб-версии.</p>
      ),
    },
    {
      label: 'Как рассчитывается компенсация за использование личного транспорта?',
      children: (
        <p>
          Выплата компенсации в месяце разделена на 4 периода: с 1 по 7, с 8 по 15, с 16 по 23, с 24 по последнее число месяца.
          <br />
          <br />
          Что влияет на скорость выплаты? – утверждение заявки руководителем и чек-ин.
          Если вы используете автоматический чек-ин, то ваша заявка сразу уйдет на выплату, в данном случае утверждение руководителем не требуется.
          <br />
          <br />
          Что включено в состав суммы компенсации:
          <ol>
            <li>стоимость 1 литра топлива  -  актуализация стоимости топлива проводится на еженедельной основе в разрезе субъектов РФ на основании сайта ФСГС</li>
            <li>страхование – КАСКО и ОСАГО</li>
            <li>ТО и ремонт</li>
            <li>износ шин</li>
            <li>смазочные материалы</li>
          </ol>
          <br />
          <b>
            <u>Облагается НДФЛ</u>
          </b>
          <ol>
            <li>Банк обязан удерживать НДФЛ (13 или 15%) с компенсации расходов которые несет сотрудник на страхование</li>
            <li>Компенсация за использование платными парковками, участками дорог и переправ</li>
            <li>Если владельцем авто является не сам сотрудник или супруг/супруга, а иные родственники.</li>
          </ol>
          <br />
          Важно помнить, что банк не оплачивает содержание автомобиля сотрудника, а компенсирует расходы за использование авто в производственных целях.
        </p>
      ),
    },
    {
      label: 'Как происходит процесс согласования поездок?',
      children: (
        <p>
          Автосогласование предусмотрено только для руководителей самостоятельных структурных подразделений (ТС 4594).
          <br />
          Сначала руководитель согласовывает маршрут и производственную необходимость,
          повторно заявка приходит на утверждение только в том случае если у сотрудника не сработал автоматический чек ин хотя бы по одной из точек или вносились изменения в маршрут.
        </p>
      ),
    },
    {
      label: 'Как зарегистрировать личный транспорт в приложении для получения компенсации?',
      children: (
        <p>В личном кабинете завести автомобиль по аналогии с веб-интерфейсом.</p>
      ),
    },
    {
      label: 'Что делать, если программа не дает указать более 10 адресов (составить сложные маршруты)?',
      children: (
        <p>Мы можем составить сложный маршрут с указанием до 19 адресов, в случае, если функционал не доступен, обратитесь в службу поддержки.</p>
      ),
    },
    {
      label: 'Что делать, если приложение зависло и не дает начать поездку?',
      children: (
        <p>
          Рекомендуем подождать некоторое время, перезапустить приложение и при необходимости повторно создать заявку.
          В случае, если этого сделать не удается, пожалуйста обратитесь в службу поддержки транспортных сервисов.
        </p>
      ),
    },
    {
      label: 'Автоматический чек-ин срабатывает не в 100% случаев, что делать, когда не работает?',
      children: (
        <p>Если в моменте не сработал автоматический чек-ин, система позволяет сделать отметки вручную.</p>
      ),
    },
    {
      label: 'Есть ли возможность учитывать пробки, дорожное покрытие и др. дорожную обстановку,\n'
      + 'можно ли в расчете учитывать объем двигателя личного транспорта?',
      children: (
        <p>
          В расчете компенсации по ЛТ учитывается объем двигателя.
          Формула расчета по компенсации регламентирована налоговым законодательством.
          Мы включили все составляющие, которые позволяет законодательство.
          Пожалуйста, проверьте данные о двигателе вашего автомобиля в личном кабинете.
        </p>
      ),
    },
    {
      label: 'Почему компенсация приходит не день в день?',
      children: (
        <p>Выплата производится 4 раза в месяц. Скорость выплат выше, если используется автоматический чек ин.</p>
      ),
    },
    {
      label: 'Не все населенные пункты внесены в ПО, что делать, если нет возможности выбрать населенный пункт?',
      children: (
        <p>
          В данном случае необходимо обратиться в транспортное подразделение вашего ГОСБ,
          какой населенный пункт не внесен, чтоб нам передали данную информацию.
        </p>
      ),
    },
    {
      label: 'Можно ли при расчете компенсации учитывать расход автомобиля?',
      children: (
        <p>
          Формула расчета по компенсации регламентирована налоговым законодательством.
          Мы включили все составляющие, которые позволяет законодательство.
        </p>
      ),
    },
  ],
  [ServiceType.CARGO]: [
    {
      label: 'При создании маршрута зависает приложение, что делать?',
      children: (
        <p>
          Приложение СберТранспорт на данный момент находится на стадии активной разработки, мы регулярно добавляем новое, фиксируем неполадки.
          Рекомендуем немного подождать, перезагрузить приложение и попробовать заново.
          В случае, если вопрос остался нерешенным, пожалуйста, зафиксируйте инцидент в службе поддержки.
        </p>
      ),
    },
    {
      label: 'Что делать, если нет возможности связаться с водителем напрямую/курьер не сообщает о своем прибытии заранее?',
      children: (
        <p>
          Мы предусмотрели возможность связи с водителем напрямую, курьеры также обязаны сообщать заранее о своем прибытии,
          если вдруг у вас была ситуация, когда с вами не связались, пожалуйста, зафиксируйте инцидент в службе поддержки,
          мы свяжемся с контрагентом на вашей территории и обязательно поможем.
        </p>
      ),
    },
    {
      label: 'Что делать, если при выборе груза нет нужных наименований?',
      children: (
        <p>
          За 2024 год и первый квартал 2025 года мы внесли более 1000 наименований различных грузов и продолжаем дорабатывать данный список.
          В случае, если все же в списке грузов нужного вам не оказалось, пожалуйста, выберите аналог и зафиксируйте инцидент в службе поддержки.
        </p>
      ),
    },
    {
      label: 'Как выбрать подходящий тариф?',
      children: (
        <p>
          После наполнения заказа информацией об адресах сбора и доставки, а также грузе,
          система самостоятельно предложит подходящие тарифы с указанием стоимости перевозки по каждому их них.
        </p>
      ),
    },
    {
      label: 'Можно ли загрузить сразу много заказов?',
      children: (
        <p>
          Да, вы можете загрузить файл Excel с несколькими заявками одновременно через кнопку «Массовая доставка» в карточке заказа перевозки.
        </p>
      ),
    },
    {
      label: 'Где можно получить шаблон для загрузки сразу нескольких заявок?',
      children: (
        <p>
          Шаблон можно скачать в АС Сбертранспорт на станице оформления заказа по кнопке «Массовая заявка».
        </p>
      ),
    },
    {
      label: 'Где можно получить шаблон для загрузки тарифов курьерской доставке?',
      children: (
        <p>
          Шаблон для загрузки тарифов курьерской доставки находится на странице добавления тарифа.
          Тарифы – Управление тарифами – Грузовые перевозки – В фильтре выбрать «Вид услуги» «Курьерская доставка» – карандаш (редактирование тарифа) – скачать.
        </p>
      ),
    },
    {
      label: 'Что происходит после загрузки файла с несколькими заявками?',
      children: (
        <p>
          Система автоматически проанализирует ваш файл и подберёт оптимальный маршрут для всех ваших заявок.
        </p>
      ),
    },
    {
      label: 'Будет ли проверка лимита перед оформлением заказа?',
      children: (
        <p>
          Да, система рассчитает общую стоимость доставки и проверит доступный лимит вашего подразделения.
        </p>
      ),
    },
    {
      label: 'Что делать, если груз оказался повреждённым?',
      children: (
        <p>
          Повреждения фиксируются в транспортной накладной совместно с получателем.
          Если заказчик отказывается принять груз, возвращается к пункту возврата груза.
        </p>
      ),
    },
    {
      label: 'К кому можно обратиться в случае возникновения вопросов по лимиту?',
      children: (
        <p>К сотрудникам транспортного подразделения ГОСБ/ТБ.</p>
      ),
    },
    {
      label: 'Где посмотреть лимиты подразделения?',
      children: (
        <p>
          Лимиты подразделения можно посмотреть на главной странице в разделе «Финансы»
          {' '}
          {'>'}
          {' '}
          «Мои лимиты».
          Далее фильтрами настроить требуемое отображение информации.
        </p>
      ),
    },
  ],
  [ServiceType.PARKING]: [
    {
      label: 'Как оформить квоту на парковку?',
      children: (
        <p>
          Все наши парковочные квоты разделяются на две категории: постоянные и ежедневные. Постоянную квоту можно оформить, обратившись к координатору вашего блока
          (его ФИО можно найти в нашем внутреннем мессенджере Пульс — введите слово «парковка», выберете интересующий адрес и получите список координаторов).
          <br />
          <br />
          Ежедневное бронирование ограничивает максимальное количество активных квот до пяти штук на ближайшую неделю вперёд.
          <br />
          <br />
          Бронирование новых квот происходит ежедневно ровно в 13 часов. Например, в понедельник вы можете зарезервировать место на понедельник следующей недели,
          во вторник — на вторник и так далее. Имеется возможность единовременно забронировать всю пятидневку вперёд.
          <br />
          <br />
          Любые изменения в бронированных местах на следующий день необходимо внести до полудня текущего дня.
          <br />
          <br />
          Это обусловлено необходимостью передачи данных в службу безопасности, которая пока обрабатывает заявки вручную. Планируется переход на полную автоматизацию процесса (ожидаемая реализация до конца года).
          <br />
          <br />
          Наличие постоянной квоты лишает права резервирования временной дневной квоты. Нарушение правил приведет к временному запрету на пользование паркингом сроком на тридцать дней.
          Подробности указаны в документе ТС 5587.
        </p>
      ),
    },
    {
      label: 'Могут ли сотрудники банка (например, муж и жена) ездить на одном автомобиле в разные дни?',
      children: (
        <p>
          НЕТ. Один автомобиль может быть зарегистрирован только за одним сотрудником банка.
          Это требование продиктовано правилами безопасности,
          поскольку без привязки к конкретному человеку затруднительно определить личность въехавшего на территорию банка автовладельца.
        </p>
      ),
    },
    {
      label: 'Мой автомобиль заблокировали, как мне выехать с парковки?',
      children: (
        <p>
          Если ваш автомобиль оказался заблокированным другим автомобилем, воспользуйтесь нашей системой «голосового помощника»:
          <br />
          <br />
          Наберите бесплатный номер горячей линии 8 (800) 707-00-70, скажите ключевое слово «парковка» и озвучьте
          государственный регистрационный знак машины-виновницы (например, А001АА199). Обратите внимание, эта услуга действует только в том случае,
          если владелец другого автомобиля зарегистрирован в нашей внутренней телефонной книге и у него есть действующая бронь на парковку.
        </p>
      ),
    },
    {
      label: 'У меня электромобиль, я могу зарядить его на парковке банка?',
      children: (
        <p>
          На подземном паркинге по адресу Москва, Кутузовский проспект, дом 32 появился сервис быстрой зарядки электромобилей.
          <br />
          <br />
          Правила пользования простые:
          <ul>
            <li>Зайдите в раздел «Парковки» мобильного приложения СберТранспорт и нажмите кнопку «Зарядить» (прежде убедитесь, что имеете активную квоту на нужный день)</li>
            <li>Выберите свободную зарядную станцию, отметив этаж, место и тип подключения.</li>
            <li>Подключите машину в течение первых 30 секунд после активации сессии, убедитесь, что используемое зарядное устройство оригинальное и соответствует стандартам (до 220 Вольт, максимум 16 Ампер).</li>
            <li>После окончания зарядки остановите сеанс нажатием кнопки «Остановить», отключите машину от сети и переместите её на стандартное парковочное место.</li>
          </ul>
          <br />
          <b>
            Более подробно читайте в
            {' '}
            <a href="https://disk.sberbank.ru/l/c2e295604e477abfbda2" target="_blank">инструкции</a>
          </b>
        </p>
      ),
    },
  ],
};
