/* eslint-disable @stylistic/max-len */
import { FC, useState } from 'react';
import SpinLoading from 'antd-mobile/es/components/spin-loading';
import { usePrivacyPolicy } from 'api/services/DispatcherRoom/DispatcherRoom.query';
import { useAppStore } from 'stores/stores.context';
import Modal from 'components/Modal/Modal';
import Checkbox from '../../components/Checkbox/Checkbox';
import styles from './PersonalInfo.module.scss';

const PersonalInfoConsent: FC = () => {
  const [isRead, setIsRead] = useState(false);

  const { authStore } = useAppStore();

  const privacyPolicy = usePrivacyPolicy();

  const handleAgree = () => {
    privacyPolicy.mutateAsync().then(() => {
      window.dispatchEvent(new CustomEvent('privacyPolicyAgreed'));
    });
  };

  return (
    <Modal
      visible
      className={styles.modal}
      title="Согласие на обработку персональных данных"
      onClose={() => authStore.logout()}
      showCloseButton
      actions={[
        {
          key: 'agree',
          text: (
            <>
              {privacyPolicy.isPending && <SpinLoading color="white" className={styles.spin} />}
              Подписать соглашение
            </>
          ),
          primary: true,
          disabled: !isRead || privacyPolicy.isPending,
          onClick: handleAgree,
        },
      ]}
      content={(
        <div className={styles.content}>
          <pre>
            Я, действуя свободно, своей волей и в своем интересе, предоставляю настоящее согласие на обработку моих
            персональных данных (далее – Согласие) Обществу с ограниченной ответственностью «Транспортные решения» (ООО
            «Транспортные решения») (далее – Оператор), зарегистрированному по адресу: Российская Федерация, 121170, г.
            Москва, вн. тер. г. муниципальный округ Арбат, улица Арбат, дом 33, помещение 2/1, на следующих условиях:
          </pre>

          <p>
            <b>1. Цель: </b>
            предоставление услуг всех видов транспорта, в том числе такси, каршеринга, автобусов, доставки грузов и
            документов, ремонт и обслуживание транспортных средств, предоставление парковочного сервиса, сервиса по
            компенсации затрат на личный и общественный транспорт.
          </p>
          <p>
            <b>2. Состав обрабатываемых персональных данных: </b>
            фамилия, имя и отчество; номер(а) контактного(ых) телефона(ов), адрес электронной почты, должность, сведения
            о геолокации, адресах, данные водительского удостоверения и свидетельства о регистрации транспортного
            средства
          </p>
          <p>
            <b>3. Действия с персональными данными и методы их обработки: </b>
            автоматизированная и неавтоматизированная обработка с совершением следующих действий: сбор, запись,
            систематизация, накопление, хранение, уточнение (обновление, изменение), передача (предоставление, доступ),
            извлечение, использование, обезличивание, блокирование, удаление, уничтожение.
          </p>
          <p>
            <b>4. Передача данных третьим лицам: </b>
            Для достижения указанной цели обработки персональных данных ООО «Транспортные решения» привлекает третьих
            лиц – компании – агрегаторы такси, компании, предоставляющие услуги аренды транспортных средств, и иных
            внешних провайдеров/ поставщиков услуг, специализирующихся на перевозке пассажиров и багажа и имеющих
            необходимые лицензии/поставщиков логистических услуг/поставщиков услуг по ремонту и всем видам обслуживания
            транспортных средств. ООО «Транспортные решения» передает персональные данные третьим лицам в соответствии с
            документом «Перечень третьих лиц», размещенным по ссылке: https://sbertransport.ru/third
          </p>
          <p>
            <b>5.</b>
            {' '}
            Обработка Персональных данных будет осуществляться в соответствии с требованиями законодательства
            Российской Федерации.
          </p>
          <p>
            <b>6.</b>
            {' '}
            Настоящее Согласие вступает в силу с даты его предоставления Оператору и действует до его отзыва мной или
            моим представителем.
          </p>
          <p>
            <b>7.</b>
            {' '}
            Согласие может быть отозвано мной или моим представителем путем направления Оператору заявления об отзыве
            Согласия по адресу, указанному в преамбуле настоящего Согласия.
          </p>
          <p>
            <b>8.</b>
            {' '}
            В случае отзыва Согласия Оператор вправе продолжить обработку Персональных данных без моего Согласия при
            наличии оснований, предусмотренных Федеральным законом от 27.07.2006 г. № 152-ФЗ «О персональных данных».
          </p>
          <p>
            <b>9.</b>
            {' '}
            Согласие дается в форме электронного документа, подписанного простой электронной подписью (СМС-кодом).
          </p>

          <Checkbox checked={isRead} onChange={setIsRead}>
            Я ознакомился (-ась) с Политиками использования программы и конфиденциальности персональных данных
          </Checkbox>
        </div>
      )}
    />
  );
};

export default PersonalInfoConsent;
