package ru.sber.transport.authentication.business.dto;

/**
 * Области видимости пользователя. По ним выдаются роли по-умолчанию.
 */
public enum Scope {

    /**
     * Пользователь - сотрудник корп. клиента.
     */
    EMPLOYEE,

    /**
     * Пользователь - водитель контрагента.
     */
    DRIVER,

    /**
     * Пользователь - диспетчер контрагента.
     */
    DISPATCHER,

    /**
     * Пользователь - контрагент.
     */
    CONTRACTOR,

    /**
     * Пользователь - сотрудник автосервиса.
     */
    AUTOSERVICE,

    /**
     * Техническая учетная запись автосервиса.
     */
    AUTOSERVICE_TA,

    /**
     * ТУЗ для операций с внешним инстансом, например, ДЗО
     */
    TECHNICAL_ACCOUNT
}
