insert into telemechanic.transportation_subtype (id, title, transportation_type_id)
values
    -- Подвиды "КП – коммерческие перевозки"
    ('019ff5e0-6c57-7538-886e-4c8be91629fb', 'РП – регулярная перевозка пассажиров и багажа', '019fd0ef-4f99-711a-aeec-7d3639aacf04'),
    ('019ff5e1-ab1e-705a-897f-49160ac9a4e6', 'ПГ – перевозка грузов на основании договора перевозки грузов или договора фрахтования (в том числе по договору аренды транспортного средства с экипажем)', '019fd0ef-4f99-711a-aeec-7d3639aacf04'),
    ('019ff5e1-c464-7176-94a8-473fc9feec82', 'ЗП – перевозка пассажиров и багажа по заказу', '019fd0ef-4f99-711a-aeec-7d3639aacf04'),
    ('019ff5e1-d504-7338-b689-f57dc923f8f3', 'ЛТ – перевозка пассажиров и багажа легковым такси', '019fd0ef-4f99-711a-aeec-7d3639aacf04'),
    ('019ff5e1-e4d0-710b-a6c9-267a3b1addca', 'ПД – организованная перевозка групп детей автобусами (если организованная перевозка группы детей осуществляется по договору фрахтования)', '019fd0ef-4f99-711a-aeec-7d3639aacf04'),

    -- Подвиды "СН – перевозки для собственных нужд"
    ('019ff5e1-f44e-70fa-88fb-63f263b87873', 'РП – регулярная перевозка пассажиров и багажа', '019fd0ef-6f2b-731e-84ac-d2502c0899bb'),
    ('019ff5e2-0dec-7546-a431-8c96eb45cbd9', 'ПГ – перевозка грузов на основании договора перевозки грузов или договора фрахтования (в том числе по договору аренды транспортного средства с экипажем)', '019fd0ef-6f2b-731e-84ac-d2502c0899bb'),
    ('019ff5e2-26d5-71df-b31e-6e03253df79e', 'ЗП – перевозка пассажиров и багажа по заказу', '019fd0ef-6f2b-731e-84ac-d2502c0899bb'),
    ('019ff5e2-3fe4-71ca-b5ff-2fa399748b4c', 'ЛТ – перевозка пассажиров и багажа легковым такси', '019fd0ef-6f2b-731e-84ac-d2502c0899bb'),
    ('019ff5e2-5078-73dd-a0bd-f286fbe73d8f', 'ПД – организованная перевозка групп детей автобусами (если организованная перевозка группы детей осуществляется по договору фрахтования)', '019fd0ef-6f2b-731e-84ac-d2502c0899bb'),

    -- Подвиды "СТ – передвижение и работа специальных транспортных средств"
    ('019ff5e2-6556-73c2-bd8f-5ff3e883acc3', 'РП – регулярная перевозка пассажиров и багажа', '019fd0ef-a2eb-76af-a0f1-95a194377feb'),
    ('019ff5e2-75dd-706d-9fb8-05cbb41c9bb1', 'ПГ – перевозка грузов на основании договора перевозки грузов или договора фрахтования (в том числе по договору аренды транспортного средства с экипажем)', '019fd0ef-a2eb-76af-a0f1-95a194377feb'),
    ('019ff5e2-83e5-766a-bbfb-87adc5d81b3c', 'ЗП – перевозка пассажиров и багажа по заказу', '019fd0ef-a2eb-76af-a0f1-95a194377feb'),
    ('019ff5e2-9155-718c-a0aa-25b5a6808efa', 'ЛТ – перевозка пассажиров и багажа легковым такси', '019fd0ef-a2eb-76af-a0f1-95a194377feb'),
    ('019ff5e2-a245-775a-9a89-198075f64ae1', 'ПД – организованная перевозка групп детей автобусами (если организованная перевозка группы детей осуществляется по договору фрахтования)', '019fd0ef-a2eb-76af-a0f1-95a194377feb');